import styles from './instruction.module.css';
import Image from 'next/image';

const Instruction = () => {

    return (
        <>
            <main className={styles.wrap}>
                <main className={styles.main_instructions}>
                    <h2>Як розпочати навчання?</h2>
                    <ul>
                        <li>Заходь до розділу &quot;Навчання&quot;</li>
                        <li>Обирай розкладку клавіатури - на вибір є три клавіатури: </li>
                        <ol>
                            <li>українською мовою</li>
                            <li>англійською </li>
                            <li>та російською(не бажано).</li>
                        </ol>
                        <li>І потім вже можна обрати уроки.</li>
                        Якщо ви тільки почали вивчати техніку сліпого друку - бажано розпочинати
                        з першого уроку.
                    </ul>
                    <h2>Положення пальців на клавіатурі</h2>
                    <ul>
                        <li> На віртуальній клавіатурі ти можешь побачити дві горизонтальні рисочки
                            під літерами <span className={styles.btn_inst}>А</span> та <span className={styles.btn_inst}>O</span> - на клавіатурі українською і російскою, та <span className={styles.btn_inst}>F</span> і <span className={styles.btn_inst}>J</span> -
                            на англійській розкладці.</li>
                        <li>Тепер подивись на свою реальну клавіатуру - ці рисочки є і у тебе.</li>
                        <li> Поклади обидва вказівних пальці на ці рисочки. Це своєрідні орієнтири, відносно яких
                            ти і будешь запам&apos;ятовувати розташування інших клавіш.</li>
                        <li>Щоб тобі було легше розібратись якими пальцем натискати конкретні клавіші -
                            ми намалювали долоні.</li>
                        <li>Колір кожного пальця співпадає з кольором клавіші, яку
                            потрібно натискати.</li>
                        <li>Не намагайся тиснути не за планом, а як тобі зручно, адже згодом це може
                            стати причиною плутання букв.</li>
                        <li>Також рекомендуємо проходити уроки однією мовою розкладки клавіатури до повного
                            її опанування, щоб запобігти плутанини в подальшому</li>
                    </ul>
                    <h2>Розділ для програмістів</h2>
                    <div>
                        Якщо ти вже вмієшь друкувати і хочешь тільки відточити навички швидкісного друку
                        для підвищення ефективності написання коду - сміло обирай цей розділ.
                    </div>
                    <Image className={styles.main_instructions_keyboard} src="/keyBoard.png" height={150} width={300} alt="keyboard" />
                </main>
            </main>
        </>
    )
}

export default Instruction;